using PersonalWebApi.Utilities;

namespace PersonalWebApi.Models.DataAccess;
/// --------------------------------------------------------------------------------
/// <summary>
/// リポジトリ用のSQL文およびパラメータ生成のためのジェネリックインターフェース
/// </summary>
/// <typeparam name="T">エンティティ型</typeparam>
/// --------------------------------------------------------------------------------
public interface ISqlHelper<T> {

    /// --------------------------------------------------------------------------------
    /// <summary>
    /// [SELECT] 全件取得
    /// </summary>
    /// <returns>SQL</returns>
    /// --------------------------------------------------------------------------------
    string GetSelectSql();

    /// --------------------------------------------------------------------------------
    /// <summary>
    /// [SELECT] 主キー指定で取得
    /// </summary>
    /// <returns>SQL</returns>
    /// --------------------------------------------------------------------------------
    string GetSelectByIdSql();

    /// --------------------------------------------------------------------------------
    /// <summary>
    /// [INSERT] 新規登録
    /// </summary>
    /// <returns>SQL</returns>
    /// --------------------------------------------------------------------------------
    string GetInsertSql();

    /// --------------------------------------------------------------------------------
    /// <summary>
    /// [UPDATE] 既存レコード更新
    /// </summary>
    /// <returns>SQL</returns>
    /// --------------------------------------------------------------------------------
    string GetUpdateSql();

    /// --------------------------------------------------------------------------------
    /// <summary>
    /// エンティティをSQL操作用のQueryParameterCollectionに変換する
    /// </summary>
    /// <param name="entity">エンティティオブジェクト</param>
    /// <returns>SQL用パラメータコレクション</returns>
    /// --------------------------------------------------------------------------------
    QueryParameterCollection ToParameterCollection(T entity);

}